{
  "resourceType": "ValueSet",
  "id": "UKCore-PathologyAndLaboratoryMedicineObservables",
  "url": "https://fhir.hl7.org.uk/ValueSet/UKCore-PathologyAndLaboratoryMedicineObservables",
  "version": "1.0.0",
  "name": "UKCorePathologyAndLaboratoryMedicineObservables",
  "title": "UK Core Pathology And Laboratory Medicine Observables",
  "status": "active",
  "date": "2023-11-28",
  "publisher": "HL7 UK",
  "contact": [ {
    "name": "HL7 UK",
    "telecom": [ {
      "system": "email",
      "value": "ukcore@hl7.org.uk",
      "use": "work",
      "rank": 1
    } ]
  } ],
  "description": "A set of codes regarding laboratory medicine test results intended for use by pathology services and their users. Selected from the SNOMED CT UK coding system:   \r\n - memberOf 1853551000000106 | Pathology and laboratory medicine observable entity simple reference set  \r\n - memberOf 999002881000000100 | Pathology Bounded Code List observables simple reference set",
  "copyright": "Copyright © 2021+ HL7 UK Licensed under the Apache License, Version 2.0 (the \"License\"); you may not use this file except in compliance with the License. You may obtain a copy of the License at  http://www.apache.org/licenses/LICENSE-2.0 Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License. HL7® FHIR® standard Copyright © 2011+ HL7 The HL7® FHIR® standard is used under the FHIR license. You may obtain a copy of the FHIR license at  https://www.hl7.org/fhir/license.html.<br$gt;This value set includes content from SNOMED CT, which is copyright © 2002+ International Health Terminology Standards Development Organisation (IHTSDO), and distributed by agreement between IHTSDO and HL7. Implementer use of SNOMED CT is not covered by this agreement.",
  "compose": {
    "include": [ {
      "system": "http://snomed.info/sct",
      "filter": [ {
        "property": "constraint",
        "op": "=",
        "value": "memberOf 1853551000000106 or memberOf 999002881000000100"
      } ]
    } ]
  }
}