{
  "resourceType": "CodeSystem",
  "id": "UKCore-SpineErrorOrWarningCode",
  "url": "https://fhir.hl7.org.uk/CodeSystem/UKCore-SpineErrorOrWarningCode",
  "version": "1.0.0",
  "name": "UKCoreSpineErrorOrWarningCode",
  "title": "UK Core Spine Error Or Warning Code",
  "status": "active",
  "date": "2022-01-07",
  "publisher": "HL7 UK",
  "contact": [ {
    "name": "HL7 UK",
    "telecom": [ {
      "system": "email",
      "value": "ukcore@hl7.org.uk",
      "use": "work",
      "rank": 1
    } ]
  } ],
  "description": "A set of codes that define types of Spine error and warning.",
  "copyright": "Copyright © 2021+ HL7 UK Licensed under the Apache License, Version 2.0 (the \"License\"); you may not use this file except in compliance with the License.  You may obtain a copy of the License at  http://www.apache.org/licenses/LICENSE-2.0 Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the License for the specific language governing permissions and limitations under the License. HL7® FHIR® standard Copyright © 2011+ HL7 The HL7® FHIR® standard is used under the FHIR license. You may obtain a copy of the FHIR license at  https://www.hl7.org/fhir/license.html.",
  "caseSensitive": true,
  "content": "complete",
  "concept": [ {
    "code": "ACCESS_DENIED",
    "display": "Access has been denied to process this request",
    "definition": "Used when the user does not have permission for a particular request. e.g. when their ASID does not have the correct interactions attached to it."
  }, {
    "code": "FAILURE_TO_PROCESS_MESSAGE",
    "display": "Failure to process message",
    "definition": "A default message when something really bad has happened that the system could not handle."
  }, {
    "code": "UNABLE_TO_CALL_SERVICE",
    "display": "Unable to call service",
    "definition": "For a synchronous request, the downstream domain processing has not completed within the configured timeout period."
  }, {
    "code": "UNSUPPORTED_SERVICE",
    "display": "Unsupported service",
    "definition": "The service the user requested is an endpoint that does not exist - so is unsupported. e.g. /Patient/9999999999/Pets"
  }, {
    "code": "RESOURCE_NOT_FOUND",
    "display": "Resource not found",
    "definition": "The resource was not found."
  }, {
    "code": "INVALID_RESOURCE_ID",
    "display": "Invalid resource ID",
    "definition": "The resource ID was not valid. For example a NHS Number is presented which is not a valid NHS Number."
  }, {
    "code": "INVALIDATED_RESOURCE",
    "display": "Invalidated resource",
    "definition": "The resource has been invalidated so could not be returned."
  }, {
    "code": "INVALID_SEARCH_DATA",
    "display": "Invalid search data",
    "definition": "The search parameters are invalid. A description of what exactly is at fault will be added to the display."
  }, {
    "code": "TOO_MANY_MATCHES",
    "display": "Too many matches",
    "definition": "Too many matches were found - user should refine their search parameters."
  }, {
    "code": "PRECONDITION_FAILED",
    "display": "Precondition failed",
    "definition": "Request missing basic requirements such as If-Match header (or invalid headers)."
  }, {
    "code": "RESOURCE_VERSION_MISMATCH",
    "display": "Resource version mismatch",
    "definition": "The resource version has changed since your last read, so the update has been rejected."
  }, {
    "code": "FORBIDDEN_UPDATE",
    "display": "Forbidden update",
    "definition": "The user is not permitted to update certain resources or elements - a detailed description will be added to the display. For example - updating a sensitive patient or adding a formal death notification is only permitted from certain systems."
  }, {
    "code": "VALIDATION_ERROR",
    "display": "Validation error",
    "definition": "This it the 'default' error thrown when no others are applicable."
  }, {
    "code": "INVALID_UPDATE",
    "display": "Invalid update",
    "definition": "The update was invalid - a detailed description will be added to the display."
  }, {
    "code": "MISSING_VALUE",
    "display": "Missing value",
    "definition": "There was a missing value in the request. For example - a name update that is missing the surname. The missing value will be presented in the display."
  }, {
    "code": "INVALID_VALUE",
    "display": "Invalid value",
    "definition": "There was an invalid value in the request. For example - a name update where the surname is too long. The invalid value and field will be presented in the display."
  }, {
    "code": "UNSUPPORTED_VALUE",
    "display": "Unsupported value",
    "definition": "There was an unsupported value in the request. The value may be valid in the schema - however it could be a legacy value that we do not allow to be set anymore. For example - setting the death notification status to 'removed'. The invalid value and field will be presented in the display."
  }, {
    "code": "TOO_FEW_VALUES_SUBMITTED",
    "display": "Too few values submitted",
    "definition": "The field in question has a minimum number of items and the user sent too few."
  }, {
    "code": "TOO_MANY_VALUES_SUBMITTED",
    "display": "Too many values submitted",
    "definition": "The field in question has a maximum number of items and the user sent too many."
  }, {
    "code": "ADDITIONAL_PROPERTIES",
    "display": "Additional properties",
    "definition": "The user sent additional properties within the dictionary. For example sending a patient patch and attempting to add 'pets', which is not an allowed field within the patient resource."
  }, {
    "code": "POLLING_ID_NOT_FOUND",
    "display": "Polling ID not found",
    "definition": "When polling the ID was not found - or it was not applicable such as a non polling ID."
  }, {
    "code": "POLLING_MESSAGE_FAILURE",
    "display": "Polling message failure",
    "definition": "When polling an ID, a message was found to be in a failed state, so there is nothing else to be done and should be considered a failure."
  } ]
}