{
  "resourceType": "CodeSystem",
  "id": "UKCore-MedicationRequestCategory",
  "url": "https://fhir.hl7.org.uk/CodeSystem/UKCore-MedicationRequestCategory",
  "version": "1.1.1",
  "name": "UKCoreMedicationRequestCategory",
  "title": "UK Core Medication Request Category",
  "status": "active",
  "date": "2023-10-06",
  "publisher": "HL7 UK",
  "contact": [ {
    "name": "HL7 UK",
    "telecom": [ {
      "system": "email",
      "value": "ukcore@hl7.org.uk",
      "use": "work",
      "rank": 1
    } ]
  } ],
  "description": "A set of codes to define additional category concepts for a medication request.",
  "copyright": "Copyright © 2021+ HL7 UK Licensed under the Apache License, Version 2.0 (the \"License\"); you may not use this file except in compliance with the License. You may obtain a copy of the License at  http://www.apache.org/licenses/LICENSE-2.0 Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License. HL7® FHIR® standard Copyright © 2011+ HL7 The HL7® FHIR® standard is used under the FHIR license. You may obtain a copy of the FHIR license at  https://www.hl7.org/fhir/license.html.",
  "caseSensitive": true,
  "content": "complete",
  "concept": [ {
    "code": "leave",
    "display": "Leave",
    "definition": "Requests for medications that the patient will take away with him/her during any short break from inpatient care. Typically requests would be dispensed by the hospital pharmacy to be self-administered at home with or without the assistance of community based nursing staff."
  }, {
    "code": "primarycare",
    "display": "Primary Care",
    "definition": "Requests for medications originating in a primary care setting. Typically requests would be dispensed by the patients nominated pharmacy to be self-administered at home with or without the assistance of community based nursing staff.",
    "property": [ {
      "code": "inactive",
      "valueBoolean": true
    } ]
  } ]
}